sqdbruh/Adafruit_nRF52_Bootloader/src/boards/boards.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2018 Ha Thach for Adafruit Industries
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "boards.h"
#include "nrf_pwm.h"
#include "app_scheduler.h"
#include "app_timer.h"
#include "segmented_digits.h"

#ifdef LED_APA102
#include "nrf_spim.h"
#endif

#define SCHED_MAX_EVENT_DATA_SIZE           sizeof(app_timer_event_t)        /**< Maximum size of scheduler events. */
#define SCHED_QUEUE_SIZE                    30                               /**< Maximum number of events in the scheduler queue. */

#if defined(LED_NEOPIXEL) || defined(LED_RGB_RED_PIN) || defined(LED_APA102)
void neopixel_init(void);
void neopixel_write(uint8_t* pixels);
void neopixel_teardown(void);
#endif


//--------------------------------------------------------------------+
// IMPLEMENTATION
//--------------------------------------------------------------------+

static uint32_t _systick_count = 0;
void SysTick_Handler(void) {
  _systick_count++;
  led_tick();
}

void button_init(uint32_t pin) {
  if (BUTTON_PULL == NRF_GPIO_PIN_PULLDOWN) {
    nrf_gpio_cfg_sense_input(pin, BUTTON_PULL, NRF_GPIO_PIN_SENSE_HIGH);
  } else {
    nrf_gpio_cfg_sense_input(pin, BUTTON_PULL, NRF_GPIO_PIN_SENSE_LOW);
  }
}

bool button_pressed(uint32_t pin) {
  uint32_t const active_state = (BUTTON_PULL == NRF_GPIO_PIN_PULLDOWN ? 1 : 0);
  return nrf_gpio_pin_read(pin) == active_state;
}
#define HIGH 1
#define LOW 0
static const uint32_t led188[] = {SEGMENT_PIN_0, SEGMENT_PIN_1, SEGMENT_PIN_2, SEGMENT_PIN_3, SEGMENT_PIN_4};
static uint32_t currentState;

static void disable_all_segments(){
        for (uint32_t ledPinIndex = 0; ledPinIndex < sizeof(led188)/sizeof(led188[0]); ledPinIndex++) {
            uint32_t pin_number = led188[ledPinIndex];
            nrf_gpio_cfg_input(pin_number, NRF_GPIO_PIN_NOPULL);
        }
}

static uint32_t currentSegment;
static uint32_t segmentWait;
static uint32_t segmentWaitMax;
static struct segment_info loadingSegments[] = {f2, e2, d2, d3, c3, b3, a3, a2};

static void segment_display_tick() 
{
    uint16_t digit;
    struct segment_info seg = segments[0];

    if(segmentWait < segmentWaitMax){
        segmentWait++;
        if(segmentWait == segmentWaitMax){
            segmentWait = 0;
        }
    }

    if(segmentWait == 0)
    {
        if(currentState == STATE_USB_MOUNTED)
        {
            digit = letter_bootloader;
            segmentWaitMax = 1;

            bool isSegmentSet = false;
            do{
                uint16_t mask = (1 << currentSegment);
                isSegmentSet = (mask & digit) == mask;
                seg = segments[currentSegment];
                currentSegment++;
                if(currentSegment == sizeof(segments)/sizeof(segments[0])){
                    currentSegment = 0;
                }
            }
            while(!isSegmentSet);
        }
        else
        {
            segmentWaitMax = 50;
            seg = loadingSegments[currentSegment];
            currentSegment++;
            if(currentSegment == sizeof(loadingSegments)/sizeof(loadingSegments[0])){
                currentSegment = 0;
            }
        }

        for (uint32_t ledPinIndex = 0; ledPinIndex < sizeof(led188)/sizeof(led188[0]); ledPinIndex++) {
            uint32_t pin_number = led188[ledPinIndex];
            if (ledPinIndex == seg.high - 1) {
                nrf_gpio_cfg_output(pin_number);
                nrf_gpio_pin_write(pin_number, HIGH);
            } else if (ledPinIndex == seg.low - 1) {
                nrf_gpio_cfg_output(pin_number);
                nrf_gpio_pin_write(pin_number, LOW);
            } else {
                nrf_gpio_cfg_input(pin_number, NRF_GPIO_PIN_NOPULL);
            }
        }
    }
    // NRFX_DELAY_US(500);
}

// This is declared so that a board specific init can be called from here.
void __attribute__((weak)) board_init2(void) {}

void board_init(void) {
  // stop LF clock just in case we jump from application without reset
  NRF_CLOCK->TASKS_LFCLKSTOP = 1UL;

  // Use Internal OSC to compatible with all boards
  NRF_CLOCK->LFCLKSRC = CLOCK_LFCLKSRC_SRC_RC;
  NRF_CLOCK->TASKS_LFCLKSTART = 1UL;



  button_init(BUTTON_DFU);
  button_init(BUTTON_FRESET);
  NRFX_DELAY_US(100); // wait for the pin state is stable

// #if LEDS_NUMBER > 0
//   // use PMW0 for LED RED
//   led_pwm_init(LED_PRIMARY, LED_PRIMARY_PIN);
//   #if LEDS_NUMBER > 1
//   led_pwm_init(LED_SECONDARY, LED_SECONDARY_PIN);
//   #endif
// #endif

#if defined(LED_NEOPIXEL) || defined(LED_RGB_RED_PIN) || defined(LED_APA102)
  // use neopixel for use enumeration
  #ifdef NEOPIXEL_POWER_PIN
  nrf_gpio_cfg_output(NEOPIXEL_POWER_PIN);
  nrf_gpio_pin_write(NEOPIXEL_POWER_PIN, 1);
  #endif

  neopixel_init();
#endif

#if ENABLE_DCDC_0 == 1
  NRF_POWER->DCDCEN0 = 1;
#endif
#if ENABLE_DCDC_1 == 1
  NRF_POWER->DCDCEN = 1;
#endif

  // Make sure any custom inits are performed
  board_init2();

  // When board is supplied on VDDH (and not VDD), this specifies what voltage the GPIO should run at
  // and what voltage is output at VDD. The default (0xffffffff) is 1.8V; typically you'll want
  //     #define UICR_REGOUT0_VALUE UICR_REGOUT0_VOUT_3V3
  // in board.h when using that power configuration.
#ifdef UICR_REGOUT0_VALUE
  if ((NRF_UICR->REGOUT0 & UICR_REGOUT0_VOUT_Msk) != (UICR_REGOUT0_VALUE << UICR_REGOUT0_VOUT_Pos)){
    NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen << NVMC_CONFIG_WEN_Pos;
    while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}
    NRF_UICR->REGOUT0 = (NRF_UICR->REGOUT0 & ~((uint32_t)UICR_REGOUT0_VOUT_Msk)) |
                        (UICR_REGOUT0_VALUE << UICR_REGOUT0_VOUT_Pos);

    NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren << NVMC_CONFIG_WEN_Pos;
    while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

    NVIC_SystemReset();
  }
#endif

  // Init scheduler
  APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);

  // Init app timer (use RTC1)
  app_timer_init();

  // Configure Systick for led blinky
  NVIC_SetPriority(SysTick_IRQn, 7);
  SysTick_Config(SystemCoreClock / 1000);


  disable_all_segments();


    // nrf_gpio_cfg_output(led188[0]);
    // nrf_gpio_cfg_output(led188[1]);
    // nrf_gpio_pin_write(led188[0], HIGH);
    // nrf_gpio_pin_write(led188[1], LOW);
}

// Actions at the end of board_teardown.
void __attribute__((weak)) board_teardown2(void) {}

void board_teardown(void) {
  // Disable systick, turn off LEDs
  SysTick->CTRL = 0;

